[
  {
    "id": 1,
    "title": "Emerging Technologies - Impact & Remedies",
    "description": "In today’s rapidly evolving digital landscape, emerging technologies such as artificial intelligence, Internet of Things, robotic process automation, and social media technologies are profoundly transforming organisational structures, operations, and strategies. These technologies drive complexity by fostering hyper-connectivity and dynamic interdependencies among people, processes, and systems (Benbya et al., 2020). While they offer significant opportunities for innovation and competitive advantage, they also introduce unpredictability and systemic challenges that many organisations struggle to manage. As a result, organisations are compelled to adopt adaptive approaches that can mitigate the burdens of digitalisation. By embracing strategies, such as the thoughtful application of digital solutions, designing evolvable systems, embracing complexity science approaches, cultivating IT-enabled agility, and strategically configuring organisational capabilities, firms can better navigate digital complexity (Benbya et al., 2020). This article explores the dual impact of emerging technologies and outlines strategies organisations can adopt to reduce their disruptive effects.",
    "date": "15 May 2025",
    "keywords": [
      "Emerging Technologies",
      "Artificial Intelligence (AI)",
      "Internet of Things (IoT)",
      "Robotic Process Automation (RPA)",
      "Social Media Technologies (SMT)",
      "Digital Transformation",
      "Organisational Agility",
      "Complexity Management"
    ],
    "buttons": [
      {
        "button_link": "https://raw.githubusercontent.com/rishikdev/articles/main/Emerging%20Technologies%20-%20Impact%20%26%20Remedies.pdf",
        "button_text": "Download"
      },
      {
        "button_link": "https://github.com/rishikdev/articles/blob/main/Emerging%20Technologies%20-%20Impact%20%26%20Remedies.pdf",
        "button_text": "View"
      }
    ]
  },

  {
    "id": 2,
    "title": "Artificial Intelligence - Definition, Opinion, Examples, and Perception",
    "description": "Artificial Intelligence (AI) has emerged as one of the most transformative technologies of the 21st century, influencing fields as diverse as healthcare, business, education, and law. As AI capabilities continue to expand, so too does the complexity of defining and understanding its true nature. This article explores four core dimensions of AI: its definition, current availability and role in augmenting human tasks, key technologies that exemplify its use, and the varying perceptions of AI across industries and geographic contexts. Moreover, it highlights both the promise and limitations of AI in practical settings, offering a nuanced view of its current impact and future trajectory.",
    "date": "22 July 2025",
    "keywords": [
      "Artificial Intelligence (AI)",
      "Machine Learning",
      "Generative AI",
      "Convolutional Neural Networks (CNNs)",
      "Edge Intelligence",
      "Human–AI Collaboration",
      "AI Perception and Adoption",
      "Ethical and Legal Implications of AI"
    ],
    "buttons": [
      {
        "button_link": "https://raw.githubusercontent.com/rishikdev/articles/main/Artificial%20Intelligence%20-%20Definition%2C%20Opinion%2C%20Examples%2C%20and%20Perception.pdf",
        "button_text": "Download"
      },
      {
        "button_link": "https://github.com/rishikdev/articles/blob/main/Artificial%20Intelligence%20-%20Definition%2C%20Opinion%2C%20Examples%2C%20and%20Perception.pdf",
        "button_text": "View"
      }
    ]
  },

  {
    "id": 3,
    "title": "AI World Order: How Artificial Intelligence is Reshaping Global Authority and Legitimacy",
    "description": "Artificial intelligence (AI) is driving a profound transformation, creating a new, unstable “AI World Order,” simultaneously centralising and decentralising power. On one hand, AI enhances authoritarian surveillance, concentrates geopolitical power in Big Tech, and intensifies a U.S.-China great power competition. On the other, it empowers non-state actors with generative tools, disperses agency via autonomous systems, and fragments the global information environment. This paradox is systemically eroding the post-World War II order’s foundations: state sovereignty, traditional statecraft, and the coherence of international law. In their place, new, competing authorities are rising. This paper examines this transformation, arguing that the resulting crises of agency, responsibility, and truth demand not just AI governance, but a reinvention of political legitimacy in a world where authority itself is being redefined.",
    "date": "03 November 2025",
    "keywords": [
      "Artificial Intelligence (AI)",
      "International Relations (IR)",
      "Global Order",
      "Sovereignty",
      "Great Power Competition",
      "Information Warfare",
      "International Law",
      "Big Tech"
    ],
    "buttons": [
      {
        "button_link": "https://preprints.apsanet.org/engage/api-gateway/apsa/assets/orp/resource/item/69051666a482cba122565663/original/ai-world-order-how-artificial-intelligence-is-reshaping-global-authority-and-legitimacy.pdf",
        "button_text": "Download"
      },
      {
        "button_link": "https://doi.org/10.33774/apsa-2025-30cfd",
        "button_text": "View"
      }
    ]
  },

  {
    "id": 4,
    "title": "Artificial Intelligence and Modern Warfare: Strategic Stability and the Changing Global Balance of Power",
    "description": "Artificial intelligence (AI) is reshaping warfare and the global balance of power. This paper argues that AI’s strategic consequences are determined by socio-political and cognitive contexts, rather than technological determinism. It examines AI’s transformation of intelligence, command and control, and autonomous weapons, alongside the weaponisation of information. Analysing national approaches, including the US, China, Russia, India, and Ukraine, it demonstrates how divergent innovation ecosystems shape AI integration. Critically, the paper highlights risks such as automation bias, algorithmic opacity, and compressed decision timelines that threaten strategic stability and increase the likelihood of inadvertent escalation. The paper concludes that managing military AI requires robust international governance, responsible norms, and ensuring meaningful human control over lethal decisions.",
    "date": "14 November 2025",
    "keywords": [
      "Artificial Intelligence (AI)",
      "Modern Warfare",
      "Balance of Power",
      "Strategic Stability",
      "Great Power Competition",
      "Automation Bias",
      "Lethal Autonomous Weapons (LAWS)",
      "Escalation Risk"
    ],
    "buttons": [
      {
        "button_link": "https://preprints.apsanet.org/engage/api-gateway/apsa/assets/orp/resource/item/69162315ef936fb4a20cee3b/original/artificial-intelligence-and-modern-warfare-strategic-stability-and-the-changing-global-balance-of-power.pdf",
        "button_text": "Download"
      },
      {
        "button_link": "https://doi.org/10.33774/apsa-2025-gkp7z",
        "button_text": "View"
      }
    ]
  }
]
